#+TITLE: Checks Notebook
#+PROPERTY: header-args :tangle test-notebook.py :comments org

*** Load action gradient

#+begin_src python :noweb yes
# <<libraries>>
<<layers>>
<<mymodel>>
# <<training>>

val_dataloader = Prior(dist, sample_shape=[1, 1])
model.eval()

batch = val_dataloader.sample()
batch.requires_grad = True
batch.grad = torch.zeros(batch.shape) # initialize gradient

load_flow_action_gradient(batch, model)

check_force(batch, model, 0.005)
#+end_src

#+RESULTS:
: tensor([0.7140], grad_fn=<DivBackward0>)

